Repository: emirpprime/flickr-justified-gallery
Catalog: languages/fjgwpp-*.po
Languages: pt_br

source: API Key is not valid
pt_br: API Key não é valida

source: Invalid UserID
pt_br: Inválido ID de usuário

source: The 'Images Height' field must have a value greater than or equal to 30
pt_br: A altura do campo deve ser de valor maior ou igual a 30

source: The 'Photos per page' field must have a value greater than 0
pt_br: O 'Fotos por página' deve ter valor maior igual a 0

source: The 'Margins' field must have a value greater or equal than 0, and not greater than 30
pt_br: As margens do campo deve ter um valor maior igual a 0 e não maior que 30

source: Settings updated.
pt_br: Opções salvas.

source: Invalid values, the settings have not been updated
pt_br: Valores inválidos, as configurações não foram foram atualizadas

source: Help
pt_br: Ajuda

source: To display the default user's photostream, create a page and simply write the following shortcode where you want to display the gallery.
pt_br: Para mostrar o photostream do usuário, crie uma página simples escreva o seguinte atalho onde você quer mostrar a galeria

source: However, you can also use the attributes to have settings that are different than the defaults. For example:
pt_br: Entretando, você pode também usar atributos para ter as configurações diferentes do que os resultados. Por exemplo:

source: displays the latest 50 photos of the default user photostream, without any page navigation. (the other settings are the defaults)
pt_br: Mostra as últimas 50 do usuário default do photostream, sem nenhuma página de navegaçaõ(as ourtas configurações são padrão)

source: You can also configure it to show other photostreams. For example:
pt_br: Você pode também configurar isso para mostrar outro photostream. Por exemplo:

source: displays the photostream of the specified user, no matter what is the default user ID in the settings. Remember that you can use <a href="http://idgettr.com/" target="_blank">idgettr</a> to retrieve the <code>user_id</code>.
pt_br: Mostra o photostream do usuário especificado, não importando se é o usuário.padrão nas configurações. Lembre que você pode usar <a href="http://idgettr.com/" target="_blank">idgettr</a> para recuperar <code>user_id</code>.

source: Sets
pt_br: Álbums

source: To show the photos of a particular photo set (also called "album"), you need to know its <code>photoset_id</code>.
pt_br: Para mostrar as fotos de um álbum particular, você precisa conhecer seu.<code>photoset_id</code>.

source: For example, the <code>photoset_id</code> of the photo set located in the URL:
pt_br: Por exemplo, o <code>photoset_id</code> de fotos está localizado URL:

source: is:
pt_br: é:

source: You can see that it is always the number after the word '/sets/'.
pt_br: Você pode ver que isto é sempre o número depois da palavra '/sets/'.

source: To show a particular photoset, you need to use the <code>flickr_set</code> shortcode, and specify the <code>photoset_id</code> with the attribute <code>id</code>. For example:
pt_br: Para mostrar um particular photoset, você precisa usar o <code>flickr_set</code>atalho, e especificar o <code>photoset_id</code> com o atributo<code>id</code>. Por exemplo:

source: Galleries
pt_br: Galerias

source: To show the photos of a particular gallery, you need to know the <code>user_id</code> of the user that owns it, and its <code>id</code>.
pt_br: Para mostrar as fotos de uma particular galeria, você precisa conhece o <code>user_id</code> do usuário que pertence isto, e seu <code>id</code>

source: For example, the <code>id</code> of the gallery located in the URL:
pt_br: Por exemplo, o <code>id</code> da galeria está localizado na url:

source: You can see that it is always the number after the word '/galleries/'.
pt_br: Você pode ver que isto é sempre o número depois da palavra '/galleries/'.

source: To show a particular gallery, you need to use the <code>flickr_gallery</code> shortcode, and specify the <code>user_id</code> with the attribute <code>user_id</code>, and the <code>gallery_id</code> with the attribute <code>id</code>. For example:
pt_br: Para mostrar uma galeria particular, você precisa usar o código <code>flickr_gallery</code> atalho, e especificar <code>user_id</code> com o atributo <code>user_id</code>, e o <code>gallery_id</code> com o atributo <code>id</code>. Por exemplo:

source: Remember that, if the gallery is owned by the default user (specified in the settings), you don't need the <code>user_id</code> attribute in the shortcode.
pt_br: Lembre que, se a galereia pertence ao usuário padrão (Especificado nas configurações), você não precisa do <code>user_id</code> atributo no atalho.

source: Group pools
pt_br: Group Pool

source: To show the photos of a particular group pool, you need to know the group id, that you can retrieve using <a href="http://idgettr.com/" target="_blank">idgettr</a>.
pt_br: Para mostrar as fotos de um particular grupo, você precisa conhecer o id do grupo, que você quer recuperar usando <a href="http://idgettr.com/" target="_blank">idgettr</a>.

source: To show a particular group pool, you need to use the <code>flickr_group</code> shortcode, and specify the group id with the attribute <code>id</code>. For example:
pt_br: Para mostar um particular grupo, você precisa usar o <code>flick_group</code>.Por exemplo:

source: To show the photos that have some particular tags, you need to use the <code>flickr_tags</code> shortcode, and specify the <code>user_id</code> and the tags with the attribute <code>tags</code>, as a comma-delimited list of words. For example:
pt_br: Para mostrar as fotos de alguma tag particular, você precisa usar o <code>flickr_tags</code> shortcode, e especificar o <code>user_id</code> e as tags com o atributo <code>tags</code>, como uma lista de palavras separadaspor vírgula. Por exemplo

source: Displays photos with one or more of the tags listed (the list is viewed as an OR combination, that is the default behavior).
pt_br: Mostra as fotos com um ou mais tags listadas (a lista é verificada como uma combinaçãoOR, que é o compoartamento padrão

source: You can also exclude results that match a term by prepending it with a <code>-</code> character.
pt_br: Você pode também excluir resultados que combinem com o termo antecedente a isso como um <code>-</code> caracter.

source: Then, you can choose to use the list as a OR combination of tags (to return photos that have <b>any</b> tag), or an AND combination (to return photos that have <b>all</b> the tags).
pt_br: Então, você pode escolher usar a lista de tags como uma combinação de OUs (para retornar fotos que tem <b>any</b> tag) ou uma combinação AND (Para retornar fotos que tem <b>todas</b> as tags).

source: To do this, you need to use the <code>tags_mode</code>, specifying "any" or "all". For example:
pt_br: Para fazer isso, você precisa usar <code>tags_mode</code>, especificando "any" or "all". Por exemplo:

source: Displays photos with all the tags listed (the list is viewed as an AND combination).
pt_br: Motra fotos com todas as tags listadas (a listagem é exibida como a lógica AND).

source: Remember that, if the photo that you want to display is owned by the default user (specified in the settings), you don't need the <code>user_id</code> attribute in the shortcode.
pt_br: Lembre que, se a foto que você quer mostrar pertence ao usuário padrão (especificado nas configurações), você não precisa do <code>use_id</code> atributo no atalho

source: Settings
pt_br: Configurações

source: Global Settings
pt_br: Configurações globais

source: Flickr API Key
pt_br: Chave da API do Flickr

source: Get your Flickr API Key from
pt_br: Consiga sua API do Flickr de

source: You can't use an attribute to change this setting
pt_br: Você não pode usar um atributo para mudar essa configuração

source: Default Settings
pt_br: Configurações padrão

source: User ID
pt_br: ID de usuário

source: Get the User ID from
pt_br: Pegue o User ID de

source: You can use the <code>
pt_br: Você pode usar o <code>

source: </code> attribute to change this default value
pt_br: </code> atributo para mudar o valor padrão

source: Images Height (in px)
pt_br: Altura das imagens (in px)

source: Maximum number of photos per page
pt_br: Máximo número de fotos por página

source: Last Row
pt_br: Última linha

source: Justify
pt_br: Justificativa

source: No justify
pt_br: Sem justificativa

source: Hide if it cannot be justified
pt_br: Esconda se não for possível ser justificado

source: </code> attribute to change this default value (with the value <code>justify</code>, <code>nojustify</code> or <code>hide</code>)
pt_br: </code> atributo para mudar o valor padrão (com o valor <code>justify</code>, <code>nojustify</code> o <code>hide</code>).

source: Fixed Height
pt_br: Altura fixa

source: If enabled, each row has the same height, but the images will be cut more.
pt_br: Se habilitado, cada linha tem a mesma altura, mas as imagens irão ser cortadas.

source: </code> attribute to change this default value (with the value <code>true</code> or <code>false</code>)
pt_br: </code> atributo para mudar o valor padrão (com o valor <code>true</code> ou <code>false</code>).

source: Pagination
pt_br: Paginação

source: None
pt_br: Nenhum

source: Previous and Next
pt_br: Anterior e próximo

source: Page Numbers
pt_br: Número de páginas

source: If enabled, navigation buttons will be shown, and you can see the older photos.<br/><i>Use only one instance per page with this settings enabled!</i>
pt_br: Se habilitado, os botões de navegação serão mostrados, e você pode ver fotos maisantigas. <br/><i>Use somente uma instância por página com essa configuração habilitada! </i>

source: </code> attribute to change this default value (with the value <code>none</code>, <code>prevnext</code> or <code>numbers</code>)
pt_br: </code> atributo para mudar o valor padrão (com o valori <code>none</code>, <code>prevnext</code> ou <code>numbers</code>).

source: </code> attribute to change this default value (with the value <code>none</code>, <code>colorbox</code> or <code>swipebox</code>).
pt_br: </code> atributo para mudar o valor padrão (com o valor <code>none</code>, <code>colorbox</code> ou <code>swipebox</code>).

source: Provide Colorbox
pt_br: Prover Colorbox

source: Provide Swipebox
pt_br: Prover Swipebox

source: Decide to include the lightbox libraries. Without them checked, make sure that you have installed the chosen lightboxes with a plugin (e.g.
pt_br: Decidir incluir as bibliotecas do lightbox. Sem elas marcas, tenha certezaque você tem instaladas a lightbox escolhida com um plugin (Ex.

source: Captions
pt_br: Subtítulos

source: If enabled, the title of the photo will be shown over the image when the mouse is over. Note: <i>captions, with small images, become aesthetically unpleasing</i>.
pt_br: Se habilitado. o título da foto será mostrado sobre a imagem quando oo mouse está sobre. Observação: <i>subtítulos, com pequenas imanes, tornam-sedesagradáveis.

source: Show descriptions
pt_br: Mostra descrizioni

source: If the captions are enabled, the descriptions will be shown inside the thumbnail captions. Observação: <i>the descriptions is not shown inside the lightbox, because Colorbox and Lightbox don't support this feature</i>.
pt_br: Se os subtítulos estão habilitados, as descrições serão mostradas dentro dothumbnail título. Note: <i>as descrições não são mostradas dentro do lightbox, porque Colorbox e Lightbox não suportam esse recurso

source: Randomize order
pt_br: Ordem aleatória

source: If enabled, the photos of the same page are randomized.
pt_br: Se habilitado, as fotos da mesma página serão randômicas

source: Margin between the images
pt_br: Margem entre as imagens

source: Open original images
pt_br: Abrir imagem original

source: If enabled, the lightbox will show the original images if they are available. Consider to leave this option off if your original images are very large.
pt_br: Se habilitado, o lightbox irá mostrar as imagens originais se elas estiveremdisponíveis. Considere deixar essa opção off se as suas imagens originais sãomuito grandes

source: Block right click
pt_br: Bloquear botão direito

source: If enabled, the context menu will be blocked, so for the user is more difficult to save the images
pt_br: Se habilitado, o menu de contexto irá ser bloqueado, então para o usuário é mais difícil salvar as imagens

source: Flickr API Wrapper Version
pt_br: Flickr API Wrapper

source: If you have some problems to communicate with the Flickr's API could be useful to change the current version of phpFlickr
pt_br: Se você tiver algum problema de comunicação com a api do Flickr poderia ser útil alterar a versão atual do phpFlickr

source: Save Changes
pt_br: Salve as alterações

source: Help the project
pt_br: Ajude o projeto

source: Help the project to grow. Donate something, or simply <a href="http://wordpress.org/plugins/flickr-justified-gallery" target="_blank">rate the plugin on Wordpress</a>.
pt_br: Ajude o projeto a crescer. Faça alguma doação, ou simplesmente <a href="http://wordpress.org/plugins/flickr-justified-gallery" target="_blank">rate the plugin on Wordpress</a>.

source: Flickr Justified Gallery can't be activated: the cache Folder is not writable
pt_br: Flickr Justified Gallery não pode ser ativado: a pasta cache não pode ser escrita

source: Flickr Justified Gallery Plugin error
pt_br: Erro Flickr Justified Gallery

source: Flickr API error
pt_br: Flickr API erro

source: You must specify the user_id for this action, using the "user_id" attribute
pt_br: Você deve especificar o user_id para essa ação, usando o "user_id" atributo

source: You must specify the id of the gallery, using the "id" attribute
pt_br: Você deve especificar o id da galeria, usando "id" atributo

source: You must specify the id of the set, using the "id" attribute
pt_br: Você deve especificar o id do álbum, usando "id" atributo

source: You must specify the tags using the "tags" attribute
pt_br: Você deve especifica as tags usando "tags" atributo

source: You must specify a valid tags_mode: "any" or "all"
pt_br: You deve especificar um tags_mode válido: "any" or "all"

source: You must specify the id of the group, using the "id" attribute
pt_br: Você deve especificar o id do grupo, usando o "id" atributo

source: The pagination attribute can be only "none", "prevnext" or "numbers".
pt_br: O atributo de paginação pode ser somente "none", "prevnext" or "numbers".

source: The last_row attribute can be only "hide", "justify" or "nojustify".
pt_br: O last_row atributo pode ser somente "hide", "justify" or "nojustify".

source: The lightbox attribute can be only "none", "colorbox" or "swipebox".
pt_br: O lightbox atributo pode ser somente "none", "colorbox" or "swipebox".

source: No photos
pt_br: sem fotos

source: <span class="meta-nav">&larr;</span> Older photos
pt_br: <span class="meta-nav">&larr;</span> Fotos antigasd

source: Newer photos <span class="meta-nav">&rarr;</span>
pt_br: Mais recentes <span class="meta-nav">&rarr;</span>
